# Revised scheme 1C after v3 exp01 and exp01b results.
# Keep the whole YOLOv8n backbone identical to baseline.
# Use SPDConv only in the neck/head P3->P4 downsampling path.
# Rationale: SPDConv in backbone P1/P2 and P3 reduced mAP50-95; moving it to the neck
# tests spatial-preserving downsampling after semantic fusion while preserving pretrained backbone features.
nc: 3
scale: n
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 P3/8, unchanged small-object feature

  - [-1, 1, SPDConv, [256, 3]] # 16 neck P3->P4 downsample
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 18 P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]] # 21 P5/32

  - [[15, 18, 21], 1, Detect, [nc]]
