# YOLOv8n + SPDConv + CoordAtt on P3/P4 fused features.
nc: 3
scale: n
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, SPDConv, [64, 3]] # 0-P1/2
  - [-1, 1, SPDConv, [128, 3]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]] # 15 P3/8
  - [-1, 1, CoordAtt, [256]] # 16 P3 attention

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]] # 19 P4/16
  - [-1, 1, CoordAtt, [512]] # 20 P4 attention

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]] # 23 P5/32

  - [[16, 20, 23], 1, Detect, [nc]]
